app/views/hobbies/index.html.erb

    <tbody>
    <% current_user.hobbies.each do |hobby| %>
---
SELECT "hobbies".* FROM "hobbies" WHERE "hobbies"."user_id" = ?  [["user_id", 3]]