app/controllers/hobbies_controller.rb

  def index
    @hobbies = Hobby.all
---
SELECT "hobbies".* FROM "hobbies"

  def create
    @hobby = current_user.hobbies.build(hobby_params)
    @hobby.hours = 0
    if @hobby.save
---
INSERT INTO "hobbies" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 09 Mar 2014 14:47:00 UTC +00:00], ["description", "This is a test"], ["name", "Test"], ["updated_at", Sun, 09 Mar 2014 14:48:06 UTC +00:00]]

  def update
    if @hobby.update(hobby_params)
---
UPDATE "hobbies" SET "created_at" = ?, "updated_at" = ? WHERE "hobbies"."id" = 1  [["created_at", Wed, 09 Apr 2014 14:47:00 UTC +00:00], ["updated_at", Sun, 09 Mar 2014 14:48:30 UTC +00:00]]

  def destroy
    @hobby.destroy
---
DELETE FROM "hobbies" WHERE "hobbies"."id" = ?  [["id", 2]]

    def set_hobby
      @hobby = Hobby.find(params[:id])
---
SELECT "hobbies".* FROM "hobbies" WHERE "hobbies"."id" = ? LIMIT 1  [["id", "3"]]